fortran.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-08-09 Sun 19:03 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>MESA Summer School 2015: Fortran Examples</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Josiah Schwab" />
<link rel="stylesheet" type="text/css" href="readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">MESA Summer School 2015: Fortran Examples</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">Fortran Examples</a>
<ul>
<li><a href="#orgheadline4">Variables</a>
<ul>
<li><a href="#orgheadline2">Declaring Variables</a></li>
<li><a href="#orgheadline3">Assigning Variables</a></li>
</ul>
</li>
<li><a href="#orgheadline9">Logic</a>
<ul>
<li><a href="#orgheadline5">Comparison Operators</a></li>
<li><a href="#orgheadline6">Logical Operators</a></li>
<li><a href="#orgheadline7">If-Then-Else</a></li>
<li><a href="#orgheadline8">Loops</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Fortran Examples</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
Here are a few quick examples of Fortran in action.  This should be
mostly sufficient to get you through the summer school.
</p>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4">Variables</h3>
<div class="outline-text-3" id="text-orgheadline4">
</div><div id="outline-container-orgheadline2" class="outline-4">
<h4 id="orgheadline2">Declaring Variables</h4>
<div class="outline-text-4" id="text-orgheadline2">
<div class="org-src-container">

<pre class="src src-f90"><span style="color: #ff7f24;">! </span><span style="color: #ff7f24;">declare a boolean variable</span>
<span style="color: #98fb98;">logical</span> ::<span style="color: #eedd82;"> flag</span>

<span style="color: #ff7f24;">! </span><span style="color: #ff7f24;">declare an integer variable</span>
<span style="color: #98fb98;">integer</span> ::<span style="color: #eedd82;"> i</span>

<span style="color: #ff7f24;">! </span><span style="color: #ff7f24;">declare a double precision variable</span>
<span style="color: #98fb98;">real</span>(dp) ::<span style="color: #eedd82;"> foo</span>

<span style="color: #ff7f24;">! </span><span style="color: #ff7f24;">declare a 1d array with 10 elements</span>
<span style="color: #98fb98;">real</span>(dp), <span style="color: #00ffff;">dimension</span>(10) ::<span style="color: #eedd82;"> bar</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-4">
<h4 id="orgheadline3">Assigning Variables</h4>
<div class="outline-text-4" id="text-orgheadline3">
<div class="org-src-container">

<pre class="src src-f90"><span style="color: #ff7f24;">! </span><span style="color: #ff7f24;">booleans have two special values</span>
flag = <span style="color: #00ffff;">.true.</span>
flag = <span style="color: #00ffff;">.false.</span>

<span style="color: #ff7f24;">! </span><span style="color: #ff7f24;">arrays are 1-indexed (using parentheses)</span>
bar(1) = 3.14
bar(2:9) = 0
bar(10) = 2.72
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9">Logic</h3>
<div class="outline-text-3" id="text-orgheadline9">
</div><div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5">Comparison Operators</h4>
<div class="outline-text-4" id="text-orgheadline5">
<p>
There are two (equivalent) forms of comparison operators in Fortran
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">text form</th>
<th scope="col" class="org-left">symbol form</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>.gt.</code></td>
<td class="org-left"><code>&gt;</code></td>
<td class="org-left">greater than</td>
</tr>

<tr>
<td class="org-left"><code>.lt.</code></td>
<td class="org-left"><code>&lt;</code></td>
<td class="org-left">less than</td>
</tr>

<tr>
<td class="org-left"><code>.ge.</code></td>
<td class="org-left"><code>&gt;=</code></td>
<td class="org-left">greater than or equal to</td>
</tr>

<tr>
<td class="org-left"><code>.le.</code></td>
<td class="org-left"><code>&lt;=</code></td>
<td class="org-left">less than or equal to</td>
</tr>

<tr>
<td class="org-left"><code>.eq.</code></td>
<td class="org-left"><code>==</code></td>
<td class="org-left">equal to</td>
</tr>

<tr>
<td class="org-left"><code>.ne.</code></td>
<td class="org-left"><code>/=</code></td>
<td class="org-left">not equal to</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-f90"><span style="color: #ff7f24;">! </span><span style="color: #ff7f24;">these are the same</span>
(i <span style="color: #00ffff;">.ne.</span> 0)
(i /= 0)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6">Logical Operators</h4>
<div class="outline-text-4" id="text-orgheadline6">
<p>
There are three logical operators: <code>.and.</code>, <code>.or.</code>, and <code>.not.</code>.
</p>
<div class="org-src-container">

<pre class="src src-f90"><span style="color: #ff7f24;">! </span><span style="color: #ff7f24;">true when 0 &lt; i &lt; 10</span>
((i &gt; 0) <span style="color: #00ffff;">.and.</span> (i &lt; 10))

<span style="color: #ff7f24;">! </span><span style="color: #ff7f24;">true when i /= 0,1</span>
(<span style="color: #00ffff;">.not.</span> ((i <span style="color: #00ffff;">.eq.</span> 0) <span style="color: #00ffff;">.or.</span> (i <span style="color: #00ffff;">.eq.</span> 1)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-4">
<h4 id="orgheadline7">If-Then-Else</h4>
<div class="outline-text-4" id="text-orgheadline7">
<div class="org-src-container">

<pre class="src src-f90"><span style="color: #ff7f24;">! </span><span style="color: #ff7f24;">here is an example of how to do some logic</span>
<span style="color: #00ffff;">if</span> (x <span style="color: #00ffff;">.gt.</span> 0) <span style="color: #00ffff;">then</span>
   heavyside = 1.0
<span style="color: #00ffff;">else if</span> (x <span style="color: #00ffff;">.lt.</span> 0) <span style="color: #00ffff;">then</span>
   heavyside = 0.0
<span style="color: #00ffff;">else</span>
   heavyside = 0.5
<span style="color: #00ffff;">end if</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8">Loops</h4>
<div class="outline-text-4" id="text-orgheadline8">
<div class="org-src-container">

<pre class="src src-f90"><span style="color: #ff7f24;">! </span><span style="color: #ff7f24;">here is an example of a do loop</span>
array(1) = 1
array(2) = 1
<span style="color: #00ffff;">do</span> i = 3, 10
   array(i) = array(i-1) + array(i-2)
<span style="color: #00ffff;">enddo</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Josiah Schwab</p>
<p class="date">Created: 2015-08-09 Sun 19:03</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
